user/tutorials/shockDroplet/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



regions
(
    boxToCell
    {

	    box (0.30 0 0) (1 1 1);
        fieldValues
        (
            volScalarFieldValue p 240e+6 
        );
    }
    sphereToCell
    {
        centre (0.5 0.5 0.5);
        radius 0.125;
        fieldValues
        (
            volScalarFieldValue C6H14 0.9998
            volScalarFieldValue N2 1e-4
            volScalarFieldValue H2O 1e-4
        );
    }
);


// ************************************************************************* //
